Tekla Open API Reference for Tekla Structures 2025
ChangeData.Source Property
 Gets the change source type.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ChangeData.ChangeSourceTypeEnum Source { get; }
Public ReadOnly Property Source As ChangeData.ChangeSourceTypeEnum
	Get
Property Value
Type: ChangeData.ChangeSourceTypeEnum
See Also
Reference
ChangeData Class
Tekla.Structures.Model Namespace